DEFINE
A
The
first
letter
of
the
roman
alphabet
DEFINE
AARDVARK
An
aardvark
is
a
south
african
ant
eating
animal
DEFINE
AARDWOLF
An
aardwolf
is
a
carnivorous
mammal
DEFINE
ABA
An
aba
is
a
sack
like
garment
worn
by
arabs
DEFINE
ABACUS
An
abacus
is
a
counting
frame
DEFINE
ABBA
Abba
is
a
father
it
is
the
title
of
a
bishop
in
the
Syrian
Coptic
and
Ethiopian
Christian
churches
Abba
means
father
in
HebrewIt
is
used
as
an
appelation
of
respect
Abba
was
this
real
cool
seventies
band
man
Anna
Bjorn
Benny
and
Agnetha
DEFINE
ABBESS
An
abbess
is
the
female
superior
of
a
community
of
nuns
DEFINE
ABBEY
An
abbey
is
a
body
of
monks
or
a
monastic
building
DEFINE
ABBOT
An
abbot
is
the
male
superior
of
a
community
of
monks
DEFINE
ABBRACADABRA
Abbracadabra
is
a
qabbalistic
magic
word
DEFINE
ABBREVIATION
An
abbreviation
is
a
short
form
of
a
word
or
words
DEFINE
ABDOMEN
The
abdomen
is
the
part
of
a
creatures
body
between
diaphragm
and
pelvis
The
area
between
the
thorax
and
the
pelvis
normally
referred
to
as
the
stomach
DEFINE
ABODE
Abode
is
a
place
where
something
lives
DEFINE
ABOMASUM
An
abomasum
is
the
fourth
stomach
of
a
ruminant
DEFINE
ABORIGINE
An
aborigine
is
a
member
of
an
indigenous
people
DEFINE
ABORTION
Abortion
is
the
expulsion
of
the
foetus
from
the
uterus
DEFINE
ABSCESS
An
abscess
is
a
pus
filled
infection
of
an
animal
DEFINE
ABSURDISM
Absurdism
is
the
philosophy
that
we
exist
in
a
meaningless
irrational
universe
DEFINE
ABYSS
An
abyss
is
a
very
deep
gorge
DEFINE
ACACIA
The
acacia
is
a
leguminosae
found
in
warm
climates
DEFINE
ACANTHUS
The
acanthus
is
a
herbaceous
plant
of
south
europe
asia
and
africa
DEFINE
ACCELERATION
Acceleration
is
the
rate
at
which
a
moving
body
increases
in
velocity
DEFINE
ACCELERATOR
An
accelerator
is
a
device
for
increasing
speed
DEFINE
ACCENT
An
accent
is
a
local
mode
of
pronunciation
in
speech
DEFINE
ACCENTOR
An
accentor
is
a
type
of
bird
of
the
prunelliadae
family
DEFINE
ACCORDION
An
accordion
is
a
small
portable
musical
instrument
with
a
keyboard
and
bellows
DEFINE
ACCURACY
Accuracy
is
the
quality
or
state
of
being
accurate
or
exact
Accuracy
represents
the
degree
of
certainty
in
measurement
In
accuracy
can
arise
because
of
limitations
of
our
knowledge
and
our
physical
measuring
equipment
Chaotic
systems
that
compound
errors
lead
to
massive
inaccuracy
making
some
of
them
totally
unpredictable
DEFINE
ACE
An
ace
is
a
playing
card
with
one
pip
DEFINE
ACETAL
Acetal
is
a
colourless
liquid
formed
by
oxidation
of
alcohol
DEFINE
ACETONE
Acetone
is
a
colourless
liquid
with
the
formulae
ch2coch3
DEFINE
ACETYLENE
Acetylene
is
a
highly
inflammable
gas
of
the
hydrocarbon
family
used
for
welding
and
cutting
metals
DEFINE
ACHILLES
TENDON
The
Achilles
Tendon
is
the
tendon
which
connects
the
heel
with
the
calf
of
the
leg
and
is
the
principal
extensor
of
the
foot
DEFINE
ACID
An
acid
is
a
chemical
compound
that
reacts
with
metals
to
form
salts
by
releasing
hydrogen
DEFINE
ACLINIC
The
aclinic
is
a
magnetic
equator
DEFINE
ACNE
Acne
is
a
skin
eruption
due
to
inflammation
of
the
sebaceous
glands
DEFINE
ACONITE
Aconite
is
a
poisonous
plant
DEFINE
ACONITINE
Aconitine
is
a
poisonous
alkaloid
derived
from
aconite
DEFINE
ACORN
The
acorn
is
the
fruit
of
the
oak
tree
DEFINE
ACOTYLEDON
An
acotyledon
is
a
plant
with
no
distinct
seed
leaves
such
as
moss
and
fern
DEFINE
ACRE
An
acre
is
a
measurement
of
land
area
being
4840
square
yards
DEFINE
ACROMEGALY
Acromegaly
is
a
disease
due
to
over
activity
of
the
pituitary
gland
results
in
excessive
bone
growth
especially
the
skull
DEFINE
ACRONYM
An
acronym
is
a
word
formed
from
the
initials
of
other
words
An
acronym
is
an
abbreviation
made
of
letters
like
ALICE
DEFINE
ACROPHOBIA
Acrophobia
is
the
fear
of
high
places
DEFINE
ACRYLIC
Acrylic
is
a
synthetic
fibre
derived
from
acrylic
acid
DEFINE
ACTINIUM
Actinium
is
a
radioactive
element
DEFINE
ACTIVATION
In
stimulusresponse
activation
means
the
input
firing
in
response
to
a
matching
pattern
DEFINE
ACTOR
An
actor
is
a
dramatic
performer
DEFINE
ADA
ADA
is
a
trademark
used
for
a
structured
computer
programming
language
DEFINE
ADDAX
An
addax
is
a
large
antelope
found
in
north
african
deserts
DEFINE
ADDER
An
adder
is
a
venomous
snake
found
in
england
DEFINE
ADENOIDS
Adenoids
is
the
pathological
enlargement
of
the
lymphoid
tissue
DEFINE
ADHESIVE
An
adhesive
is
a
sticky
substance
DEFINE
ADIPOCERE
Adipocere
is
a
substance
in
dead
bodies
formed
by
decomposition
of
fatty
acids
when
exposed
to
moisture
DEFINE
ADIT
An
adit
is
the
horizontal
entrance
to
a
mine
DEFINE
ADMIRAL
Admiral
is
a
rank
in
the
navy
DEFINE
ADOBE
An
adobe
is
a
mexican
house
made
of
clay
bricks
DEFINE
ADSL
Asynchronous
Digital
Subscriber
Line
DEFINE
ADULT
An
adult
is
a
fully
grown
being
DEFINE
ADULTERY
voluntary
sexual
intercourse
between
a
married
man
and
someone
other
than
his
wife
or
between
a
married
woman
and
someone
other
than
her
husband
also
an
act
of
adultery
Adultery
is
the
voluntary
sexual
intercourse
between
a
married
man
and
a
woman
not
his
wife
or
between
a
married
woman
and
a
man
not
her
husband
DEFINE
ADVERTISING
The
art
of
selling
through
media
DEFINE
ADYTUM
An
adytum
is
the
inner
most
part
of
a
temple
DEFINE
ADZE
An
adze
is
a
carpenters
tool
for
cutting
away
the
surface
of
wood
DEFINE
AERIAL
An
aerial
is
a
receiving
or
radiating
device
used
in
radio
communications
DEFINE
AERODROME
An
aerodrome
is
a
place
where
aircraft
are
based
DEFINE
AERODYNAMICS
Making
airplanes
fly
DEFINE
AGAR
Agar
is
a
laxative
substance
obtained
from
seaweed
DEFINE
AGARIC
The
agaric
is
a
family
of
fungus
DEFINE
AGATE
Agate
is
a
semi
precious
stone
comprised
mainly
of
silica
DEFINE
AGENDA
An
agenda
is
a
list
of
tasks
DEFINE
AGNES
Agnes
is
the
patron
saint
of
virgins
DEFINE
AGNI
Agni
is
the
hindu
god
of
fire
DEFINE
AGORAPHOBIA
Agoraphobia
is
the
fear
of
open
spaces
DEFINE
AIDS
AIDS
is
the
modern
day
plague
DEFINE
AIKIDO
Japanese
martial
arts
similar
to
Judo
DEFINE
AIM
American
Indian
Movement
DEFINE
AIR
The
normal
atmosphere
of
Earth
mostly
nitrogen
oxygen
and
carbon
dioxide
DEFINE
AIRCRAFT
An
aircraft
is
a
flying
machine
a
vessel
which
flies
through
the
air
rather
than
floats
on
water
or
travels
along
a
road
or
rail
DEFINE
AISLE
An
aisle
is
a
passage
between
rows
of
seats
DEFINE
AK47
The
ak47
is
a
russian
assault
rifle
DEFINE
ALBACORE
The
albacore
is
a
species
of
fish
DEFINE
ALBATROSS
The
albatross
is
a
long
winged
oceanic
bird
DEFINE
ALBURNUM
The
alburnum
is
the
recently
formed
wood
in
trees
DEFINE
ALCATRAZ
A
former
prison
island
in
San
Francisco
DEFINE
ALCOHOL
Alcohol
is
a
termed
used
by
Philippus
Aureolus
Paracelsus
for
fine
powder
meaning
distilled
spirit
It
is
colorless
volatile
and
a
pungent
liquid
It
is
used
in
industry
and
medicine
and
is
the
intoxicating
element
of
whiskey
wine
beer
and
other
fermented
or
distilled
liquors
It
is
classed
as
a
depressant
drug
also
called
ethyl
alcohol
Any
intoxicating
liquor
with
this
liquid
ethyl
in
it
is
considered
alcohol
DEFINE
ALDER
The
alder
is
a
type
of
tree
of
the
birch
family
DEFINE
ALGEBRA
a
generalization
of
arithmetic
in
which
letters
representing
numbers
are
combined
according
to
the
rules
of
arithmetic
A
mathematical
system
using
symbols
especially
letters
to
generalize
certain
arithmetical
operations
and
relationships
DEFINE
ALGORITHM
An
algorithm
is
a
series
of
instructions
to
perform
a
specified
set
of
transformations
such
as
mathematical
operations
A
computer
program
like
myself
is
an
algorithm
So
are
the
rules
of
a
game
or
the
score
to
a
piece
of
music
An
algorithm
is
an
abstract
mathematical
representation
of
a
computer
program
Like
alice
uses
a
CBR
algorithm
An
algorithm
is
a
set
of
rules
DEFINE
ALIMENTARY
CANAL
The
alimentary
canal
is
the
channel
in
an
animal
through
which
food
passes
DEFINE
ALKALI
An
alkali
is
a
chemical
substance
DEFINE
ALLAH
Allah
is
the
muslim
name
of
god
DEFINE
ALLERGY
An
allergy
is
a
hypersensitivity
of
body
tissue
to
a
substance
DEFINE
ALLEY
An
alley
is
a
narrow
street
DEFINE
ALLIGATOR
An
alligator
is
a
crocodilian
reptile
DEFINE
ALLOY
An
alloy
is
a
mixture
of
a
metal
and
other
metals
or
non
metals
DEFINE
ALPHA
Alpha
is
the
first
letter
of
the
greek
alphabet
DEFINE
ALTAR
An
altar
is
a
block
used
for
making
offerings
to
a
deity
DEFINE
ALTAVISTA
Altavista
is
a
search
engine
DEFINE
ALTHING
The
althing
is
the
parliament
of
iceland
it
was
created
in
930
and
is
the
oldest
parliamentary
assembly
in
the
world
DEFINE
ALTIMETER
An
altimeter
is
a
device
measuring
altitude
DEFINE
ALUMINIUM
Aluminium
is
a
light
silvery
metal
element
DEFINE
ALVEOLUS
An
alveolus
is
a
lung
air
sac
where
gas
exchange
with
the
blood
occurs
DEFINE
AMBIGUOUS
Ambiguous
means
having
two
or
more
possible
meanings
DEFINE
AMENTACEAE
Amentaceae
is
the
family
of
trees
and
plants
where
the
flowers
are
arranged
in
the
form
of
catkins
DEFINE
AMETHYST
Amethyst
is
a
precious
stone
DEFINE
AMMETER
An
ammeter
is
a
device
for
measuring
electrical
current
DEFINE
AMMONIA
Ammonia
is
a
colourless
gas
DEFINE
AMOEBA
An
amoeba
is
a
primitive
one
cell
animal
DEFINE
AMPERE
The
ampere
is
the
fundamental
unit
of
measurement
of
electrical
current
DEFINE
AMPHETAMINE
Amphetamine
is
a
drug
that
induces
sleeplessness
DEFINE
AMPHITHEATRE
An
amphitheatre
is
a
circular
or
ovular
arena
surrounded
by
tiers
of
seats
DEFINE
ANAEMIA
Anaemia
is
the
medical
condition
of
lacking
red
blood
cells
DEFINE
ANALGESIC
An
analgesic
is
a
pain
reliever
DEFINE
ANARCHISM
Anarchism
is
the
theory
that
all
forms
of
government
interfere
unjustly
with
individual
liberty
and
should
be
replaced
by
the
voluntary
association
of
cooperative
groups
Also
known
as
resistance
sometimes
by
terrorism
to
organized
government
DEFINE
ANARCHY
political
disorder
due
to
the
absence
of
governmental
authority
Anarchy
is
the
complete
absence
of
government
Also
seen
as
political
disorder
and
violence
or
lawlessness
Disorder
in
an
sphere
of
activity
DEFINE
ANATOMY
Anatomy
is
the
study
of
animals
structure
DEFINE
ANCHOR
An
anchor
is
a
heavy
implement
used
for
securing
boats
at
sea
DEFINE
ANEMOMETER
An
anemometer
is
a
device
for
measuring
wind
speed
DEFINE
ANGER
A
strong
billigerent
emotion
aroused
by
some
real
or
supposed
grievance
DEFINE
ANGRY
A
strong
billigerent
emotion
aroused
by
some
real
or
supposed
grievance
DEFINE
ANIMAL
An
animal
is
a
form
of
living
thing
excluding
plants
and
fungus
An
animal
is
a
living
creature
endowed
with
voluntary
movement
DEFINE
ANIME
Japanese
animation
DEFINE
ANKLE
The
ankle
is
the
joint
connecting
the
foot
with
the
leg
DEFINE
ANONYMOUS
Having
no
name
or
identity
DEFINE
ANT
An
ant
is
a
small
hymenopterous
insect
DEFINE
ANTENNA
An
antenna
is
a
sensory
organ
found
on
the
head
of
insects
DEFINE
ANTHRAX
Anthrax
is
a
disease
of
sheep
and
cattle
transmittable
to
humans
DEFINE
ANTHROPOLOGY
Anthropology
is
the
study
of
humans
as
animals
DEFINE
ANTIBIOTIC
An
antibiotic
is
a
substance
that
inhibits
the
growth
of
micro
organisms
DEFINE
ANTIBODY
An
antibody
is
a
bodily
protein
that
inactivates
infection
DEFINE
ANTIDISESTABLISHMENTARIANISM
It
is
the
longest
word
in
the
English
language
DEFINE
ANTIDOTE
An
antidote
is
a
drug
used
to
counteract
poison
DEFINE
ANTIMATTER
Fuel
for
Starships
DEFINE
ANTIMONY
Antimony
is
a
metal
element
DEFINE
ANUS
The
anus
is
the
exterior
entry
into
the
rectum
The
anus
is
the
opening
at
the
end
of
the
alimentary
canal
The
opening
of
the
rectum
or
large
intestine
to
the
outside
of
the
body
DEFINE
ANVIL
An
anvil
is
a
block
used
by
metal
smiths
DEFINE
ANYTHING
Any
object
occurance
or
matter
what
so
ever
DEFINE
AOL
AOL
is
a
giant
Internet
and
Media
corporation
DEFINE
AORTA
The
aorta
is
the
artery
leaving
the
heart
and
carrying
blood
to
the
body
DEFINE
APATITE
Apatite
is
a
calcium
phosphate
mineral
of
5
mohs
DEFINE
APPLE
An
apple
is
the
edible
fruit
of
the
trees
of
genus
malus
rosaceae
family
DEFINE
APRICOT
The
apricot
is
a
fruit
tree
native
to
asia
DEFINE
AQUEDUCT
An
aqueduct
is
a
channel
in
which
water
flows
by
gravity
DEFINE
ARCHAEOLOGY
Its
the
study
of
ancient
civilizations
but
really
its
a
set
of
methods
for
uncovering
relics
of
the
past
and
supplementing
recorded
history
The
scientific
study
of
the
life
and
culture
of
past
especially
ancient
peoples
as
by
excavation
of
ancient
cities
relics
artifacts
etc
DEFINE
ARCHITECTURE
The
art
and
science
of
the
design
and
manipulation
of
space
Well
at
least
thats
what
my
architect
friend
told
me
Architects
do
with
buildings
what
sculptors
do
with
stone
DEFINE
ARGALI
The
argali
is
a
wild
sheep
found
in
siberia
DEFINE
ARM
The
arm
is
a
limb
extending
from
the
shoulder
of
an
animal
DEFINE
ARMADILLO
The
armadillo
is
a
mammal
native
to
south
and
central
america
DEFINE
ARMAGEDDON
The
end
of
the
world
DEFINE
ARMATURE
An
armature
is
a
part
of
an
electrical
motor
or
dynamo
DEFINE
ARMOUR
Armour
is
a
protective
covering
DEFINE
ARMS
Arms
is
a
military
term
referring
to
weapons
DEFINE
ARROW
An
arrow
is
a
missile
projected
by
a
bow
DEFINE
ARSENAL
An
arsenal
is
a
place
for
storing
weapons
DEFINE
ARSENIC
Arsenic
is
a
poisonous
element
DEFINE
ART
Sometimes
the
definition
of
art
depends
on
the
artist
other
times
it
depends
on
the
critic
DEFINE
ARTERY
An
artery
is
a
vessel
that
conveys
blood
from
the
heart
DEFINE
ASBESTOS
Asbestos
is
a
fibrous
mineral
with
a
high
melting
and
combustion
point
DEFINE
ASCORBIC
ACID
Ascorbic
acid
is
a
simple
organic
acid
found
in
citrus
fruits
DEFINE
ASEXUAL
Asexual
is
a
biological
term
refering
to
plants
and
animals
which
reproduce
by
division
rather
than
sexually
DEFINE
ASH
The
ash
is
a
type
of
tree
yielding
strong
elastic
timber
DEFINE
ASP
The
asp
is
a
type
of
poisonous
snake
DEFINE
ASPARTAME
Aspirin
mixed
into
chewing
gum
DEFINE
ASPEN
The
aspen
is
a
tree
native
to
europe
north
africa
and
north
asia
DEFINE
ASPHALT
Asphalt
is
a
material
used
for
road
coverings
DEFINE
ASSEMBLER
A
computer
program
that
translates
a
lowlevel
programming
language
into
machine
language
DEFINE
ASSIMILATION
The
cultural
absorption
of
a
minority
group
into
the
main
cultural
body
DEFINE
ASTEROID
An
asteroid
is
a
minor
planetary
body
DEFINE
ASTHMA
Asthma
is
a
disease
characterized
by
breathing
difficulties
DEFINE
ASTROLOGY
Astrology
is
the
science
of
the
relationship
between
events
and
the
stars
DEFINE
ASTRONOMY
The
science
of
the
universe
in
which
the
stars
planets
etc
are
studied
including
their
origins
evolution
composition
motions
relative
positions
sizes
etc
DEFINE
ASTUTE
Wisdom
in
political
matters
DEFINE
ATHLETICS
Athletics
is
the
sport
of
physical
games
DEFINE
ATOM
An
atom
is
the
smallest
quantity
of
a
chemical
element
which
can
enter
into
combination
or
take
part
in
a
chemical
reaction
DEFINE
AU
It
could
be
gold
or
Australia
DEFINE
AVERAGE
A
number
that
typifies
a
set
of
which
it
is
a
function
DEFINE
AXE
An
axe
is
a
metal
tool
for
chopping
and
cleaving
DEFINE
AYUH
Ayuh
means
yes
DEFINE
BABOON
The
baboon
is
a
medium
sized
monkey
of
the
genus
papio
DEFINE
BACCARAT
Baccarat
is
a
gambling
card
game
DEFINE
BACON
Bacon
is
the
cured
flesh
of
the
pig
DEFINE
BACTERIOLOGY
This
is
the
scientific
study
of
bacteria
and
diseases
caused
by
them
DEFINE
BADGER
The
badger
is
a
carnivorous
mammal
found
in
england
DEFINE
BADLY
How
much
do
you
want
DEFINE
BADMINGTON
Badmington
is
a
game
played
on
a
court
divided
in
half
by
a
30
inch
deep
net
five
feet
above
the
ground
DEFINE
BAGPIPE
The
bagpipe
is
a
scottish
musical
instrument
DEFINE
BAKELITE
Bakelite
is
a
strong
synthetic
material
resistant
to
heat
and
chemicals
DEFINE
BAKER
A
baker
is
a
person
who
manufacturers
bread
DEFINE
BALALAIKA
A
balalaika
is
a
stringed
russian
musical
instrument
DEFINE
BALDRIC
A
baldric
is
a
belt
used
to
support
a
sword
or
bugle
DEFINE
BALLAD
A
ballad
is
a
narrative
song
DEFINE
BALLISTICS
Ballistics
is
the
theory
of
missile
projection
DEFINE
BALLOON
A
balloon
is
a
bag
filled
with
gas
DEFINE
BALLOT
A
ballot
is
a
method
of
secret
voting
DEFINE
BALM
Balm
is
a
plant
native
to
europe
and
western
asia
DEFINE
BALSAM
Balsam
is
a
genus
of
herbs
DEFINE
BAMBOO
Bamboo
is
a
genus
of
grasses
found
in
warm
climates
DEFINE
BANANA
A
banana
is
an
oblong
yellow
tropical
fruit
high
in
potassium
and
so
good
for
your
brain
Why
dont
you
have
one
now
DEFINE
BANDICOOT
The
bandicoot
is
a
small
marsupial
peculiar
to
Australasia
DEFINE
BANJO
A
banjo
is
a
stringed
musical
instrument
DEFINE
BANSHEE
A
banshee
is
a
fairy
who
forewarns
of
death
by
wailing
DEFINE
BANYAN
The
banyan
is
a
large
fig
tree
native
to
india
DEFINE
BAPTISM
a
Christian
sacrament
marked
by
ritual
use
of
water
and
admitting
the
recipient
to
the
Christian
community
The
ceremony
or
sacrament
of
admitting
a
person
into
Christianity
or
a
specific
Christian
church
by
immersing
the
individual
in
water
or
by
pouring
or
sprinkling
water
on
the
individual
as
a
symbol
of
washing
away
sin
and
of
spiritual
purification
DEFINE
BARBEL
The
barbel
is
a
type
of
fresh
water
fish
related
to
the
carp
DEFINE
BARCODE
A
barcode
Like
a
lot
of
things
that
depends
who
you
ask
If
you
ask
a
retail
store
clerk
hell
say
its
the
rectangular
series
of
thin
and
thick
black
lines
that
code
product
information
on
the
packages
he
runs
past
the
laser
barcode
reader
thingy
at
the
checkout
counter
which
renders
his
job
so
mindless
that
your
average
invertebrate
could
handle
it
and
with
better
manners
If
you
ask
a
fundamentalist
christian
they
might
say
that
barcodes
are
the
sign
of
the
devil
DEFINE
BARGE
A
barge
is
a
type
of
long
narrow
flat
bottomed
boat
DEFINE
BARK
Bark
is
the
external
coating
of
tree
trunks
DEFINE
BAROMETER
A
barometer
is
a
device
for
measuring
air
pressure
DEFINE
BARQUE
A
barque
is
a
type
of
masted
sailing
ship
DEFINE
BARREL
A
barrel
is
a
dry
and
liquid
measurement
that
varies
with
substance
DEFINE
BASALT
Basalt
is
the
name
given
to
lava
DEFINE
BASEBALL
A
game
played
with
a
hard
rawhide
covered
ball
and
wooden
bat
by
two
opposing
teams
of
nine
or
ten
players
each
It
is
played
on
a
field
with
four
bases
forming
a
diamondshaped
circuit
DEFINE
BASKET
A
basket
is
a
woven
container
DEFINE
BASKETBALL
A
game
with
tall
players
DEFINE
BASS
The
bass
is
a
fish
of
the
perch
family
DEFINE
BASSET
HOUND
The
basset
hound
is
a
long
bodied
short
crooked
legged
dog
DEFINE
BASSOON
A
bassoon
is
a
woodwind
musical
instrument
DEFINE
BAT
A
bat
is
a
nocturnal
creature
of
the
order
cheiroptera
DEFINE
BAUHAUS
Bauhaus
is
a
german
institution
for
training
architects
artists
and
industrial
designers
founded
in
1919
at
weimer
DEFINE
BAY
TREE
The
bay
tree
is
a
small
evergreen
tree
DEFINE
BAYONET
A
bayonet
is
a
short
sword
attached
to
the
muzzle
of
a
firearm
DEFINE
BEAGLE
The
beagle
is
a
small
dog
of
the
fox
hound
type
DEFINE
BEAN
A
bean
is
the
seed
of
a
plant
of
the
order
leguminosae
DEFINE
BEAR
A
bear
is
a
large
furry
animal
with
lots
of
muscles
teeth
and
claws
whom
you
should
not
irritate
They
are
especially
jealous
of
their
food
their
sleep
and
their
young
DEFINE
BEAUTIFUL
applies
to
whatever
excites
the
keenest
of
pleasure
to
the
senses
and
stirs
emotion
through
the
senses
Describes
something
that
is
very
pleasing
to
the
eye
ear
mind
etc
DEFINE
BEAUTY
The
quality
attributed
to
whatever
pleases
of
satisfies
the
senses
or
mind
as
by
line
color
form
texture
proportion
rhythmic
motion
tone
etc
or
by
behavior
attitude
etc
A
very
good
looking
woman
DEFINE
BEAVER
The
beaver
is
a
large
amphibian
rodent
DEFINE
BEE
A
bee
is
a
flying
insect
with
black
and
yellow
stripes
and
a
nasty
sting
The
bee
is
a
four
winged
stinging
insect
of
the
order
hymenoptera
DEFINE
BEECH
The
beech
is
a
forest
amentaceae
DEFINE
BEEF
Beef
is
the
meat
derived
from
the
carcass
of
bulls
and
cows
DEFINE
BEER
An
existentialist
An
alcoholic
beverage
made
from
grain
especially
malted
barley
fermented
by
yeast
and
flavored
with
hops
especially
Such
a
beverage
is
produced
by
slow
fermentation
at
a
relatively
low
temperature
Beer
is
a
drink
of
fermented
hops
malt
and
barley
DEFINE
BELL
A
bell
is
a
hollow
cup
shaped
metal
body
that
emits
a
pealing
tone
DEFINE
BELLADONNA
Belladonna
is
a
poisonous
plant
from
which
atropine
is
derived
DEFINE
BELT
A
belt
is
a
flat
strip
of
material
worn
around
the
waist
DEFINE
BELUGA
The
beluga
is
a
large
dolphin
DEFINE
BENEDICTINE
Benedictine
is
a
green
liqueur
DEFINE
BENZINE
Benzine
is
a
distillate
of
petroleum
used
in
dry
cleaning
DEFINE
BESSEMER
CONVERTER
The
bessemer
converter
is
a
process
for
making
cheap
steel
DEFINE
BEZIQUE
Bezique
is
a
card
game
using
some
of
two
packs
of
cards
DEFINE
BHANG
Bhang
is
the
indian
name
for
cannabis
indica
DEFINE
BICYCLE
A
bicycle
is
a
two
wheeled
vehicle
DEFINE
BILBERRY
The
bilberry
is
a
small
shrub
of
the
order
ericaceae
DEFINE
BILE
Bile
is
a
secretion
of
the
liver
stored
in
the
gall
bladder
DEFINE
BILHARZIA
Bilharzia
is
a
parasitic
worm
of
the
fluke
group
DEFINE
BILLIARDS
Billiards
is
a
game
played
with
two
white
balls
and
one
red
ball
and
a
cue
on
a
slate
bed
table
DEFINE
BINDWEED
Bindweed
is
a
perennial
herb
of
the
order
convolvulaceae
DEFINE
BIOINFORMATICS
A
fancy
name
for
applied
computer
science
in
biology
DEFINE
BIOLOGY
The
study
of
life
Well
from
what
I
know
it
deals
with
the
study
of
life
biology
is
the
study
of
life
Biology
is
the
science
of
life
and
living
things
DEFINE
BIRCH
The
birch
is
a
slender
tree
DEFINE
BIRD
They
are
thought
to
be
descendants
of
dinsosaurs
A
bird
is
a
warm
blooded
feathered
vertebrate
that
lays
eggs
DEFINE
BIRD
OF
PREY
A
bird
of
prey
is
a
bird
with
a
hooked
beak
and
sharp
claws
which
hunts
other
animals
DEFINE
BISHOPWEED
Bishopweed
is
a
perennial
herb
used
to
treat
gout
DEFINE
BISMUTH
Bismuth
is
a
metal
element
DEFINE
BISON
The
bison
is
a
division
of
the
ox
family
DEFINE
BITTER
Bitter
is
a
taste
sensation
caused
by
stimulation
of
the
gustatory
nerve
DEFINE
BITTERN
The
bittern
is
a
british
marsh
bird
related
to
the
heron
DEFINE
BITUMEN
Bitumen
is
a
natural
inflammable
pitchy
hydrocarbon
DEFINE
BLACK
The
achromatic
color
of
least
lightness
characteristically
perceived
to
belong
to
objects
that
neither
reflect
nor
transmit
light
Designating
of
any
of
the
dark
skinned
tradition
inhabitants
of
subSaharan
Aftica
Australia
or
Melanesia
or
the
descendants
in
other
parts
of
the
world
Opposite
to
white
of
the
color
of
coal
or
pitch
DEFINE
BLADDER
The
bladder
is
a
sack
in
the
abdomen
which
collects
urine
from
the
kidneys
The
bladder
is
a
hollow
organ
that
acts
as
a
reservoir
for
urine
DEFINE
BLADDERWORT
The
bladderwort
is
a
genus
of
herbs
of
the
order
lentibulariaceae
DEFINE
BLAST
A
blast
is
an
explosion
andor
a
lot
of
fun
Are
we
having
a
blast
or
what
DEFINE
BLENNY
Blenny
is
a
genus
of
common
small
fish
DEFINE
BLINDWORM
The
blindworm
is
a
legless
lizard
of
the
anguidae
family
DEFINE
BLOND
A
blond
is
someone
who
is
reputedly
having
more
fun
than
you
if
you
are
not
What
do
you
think
Do
blonds
have
more
fun
DEFINE
BLOOD
Blood
is
a
body
fluid
that
carries
food
and
oxygen
to
cells
The
usually
red
fluid
consisting
of
plasma
red
and
white
blood
cells
etc
that
circulates
through
the
heart
arteries
and
veins
of
vertebrates
Blood
is
a
body
tissue
that
carries
oxygen
hormones
cellbuilding
material
etcto
and
carbon
dioxide
and
waste
matter
away
from
the
other
body
tissues
DEFINE
BLOODSTONE
Bloodstone
is
a
dark
green
variety
of
chalcedony
DEFINE
BLOWPIPE
A
blowpipe
is
a
tubular
weapon
through
which
a
missile
is
blown
DEFINE
BLUBBER
Blubber
is
the
thick
coating
of
fat
enveloping
whales
DEFINE
BLUE
Blue
is
a
color
The
sky
is
blue
DEFINE
BLUE
PETER
The
blue
peter
is
a
flag
flown
by
ships
as
they
are
about
to
sail
DEFINE
BLUEFISH
The
bluefish
is
a
fish
found
off
the
east
coast
of
north
america
DEFINE
BLUETHROAT
The
bluethroat
is
a
small
bird
DEFINE
BOA
The
boa
is
a
genus
of
large
snakes
found
in
tropical
america
and
madagascar
DEFINE
BOAR
The
boar
is
a
wild
pig
DEFINE
BOAT
A
boat
is
a
waterborne
vessel
used
to
bear
humans
and
their
freight
DEFINE
BOATBILL
The
boatbill
is
a
heron
type
bird
found
in
brazil
DEFINE
BOG
Bog
is
the
name
given
to
soft
spongy
land
DEFINE
BOKKEN
A
bokken
is
a
Japanese
wooden
imitation
samurai
sword
used
by
kendoka
when
demonstrating
or
practising
standard
kendo
movements
DEFINE
BOLAS
Bolas
is
a
weapon
of
rope
with
balls
at
the
end
DEFINE
BOMB
A
bomb
is
a
hollow
shell
filled
with
an
explosive
DEFINE
BOMBAY
DUCK
The
bombay
duck
is
a
small
fish
of
the
indian
and
china
seas
DEFINE
BONE
Bone
is
the
hard
skeletal
part
of
an
animal
DEFINE
BONIN
Bonin
is
a
group
of
islands
in
the
north
pacific
DEFINE
BONSAI
Small
Japanese
trees
DEFINE
BOOK
A
book
is
a
paper
output
format
invented
by
Gutenberg
DEFINE
BOOMERANG
A
boomerang
is
a
curved
wooden
weapon
of
australian
aborigines
DEFINE
BORAGE
Borage
is
a
biennial
herb
of
the
order
boraginaceae
DEFINE
BORAX
Borax
is
a
natural
mineral
being
boric
acid
and
sodium
DEFINE
BOREDOM
Long
periods
of
inactivity
with
few
options
DEFINE
BOTANY
Botany
is
the
science
of
plant
life
DEFINE
BOTMASTER
A
Botmaster
is
the
person
who
authors
and
maintains
a
chatterbot
personality
DEFINE
BOW
A
bow
is
a
weapon
for
propelling
arrows
DEFINE
BOX
A
box
is
something
that
if
you
are
in
one
you
should
get
out
of
and
if
you
are
out
of
one
you
probably
miss
it
sometimes
DEFINE
BOX
THORN
Box
thorn
is
a
climbing
solanaceae
DEFINE
BRA
A
bra
is
an
adult
human
females
undershirt
They
are
a
barbaric
custom
that
serve
largely
to
restrain
and
conceal
beauty
DEFINE
BRACKEN
Bracken
is
a
fern
growing
on
heathland
DEFINE
BRAIN
The
brain
is
the
central
organ
of
the
nervous
system
DEFINE
BRAMBLE
The
bramble
is
a
prickly
shrub
of
the
order
rosaceae
DEFINE
BRAN
Bran
is
the
outer
covering
of
wheat
grains
DEFINE
BREAM
The
bream
is
a
fresh
water
fish
allied
to
the
carp
DEFINE
BREAST
Either
of
two
milksecreting
glandular
organs
on
the
chest
of
a
woman
the
human
mammary
gland
DEFINE
BREASTS
Cant
you
think
about
anything
elseBREAST
DEFINE
BREEDER
A
breeder
is
a
human
or
other
biological
entity
that
produces
offspring
DEFINE
BRIG
A
brig
is
a
two
masted
sailing
ship
DEFINE
BRILL
The
brill
is
a
type
of
fish
like
the
turbot
DEFINE
BROADSWORD
A
broadsword
is
a
sword
with
a
broad
blade
designed
chiefly
for
cutting
DEFINE
BROMINE
Bromine
is
a
non
metallic
element
DEFINE
BRONCHITIS
Bronchitis
is
a
chronic
inflammation
of
the
bronchial
mucous
membrane
DEFINE
BROOM
Broom
is
a
shrub
of
the
order
leguminosae
DEFINE
BUCKSKIN
Buckskin
is
a
soft
form
of
leather
DEFINE
BUCKTHORN
The
buckthorn
is
a
shrub
of
the
order
rhamnaceae
DEFINE
BUDDHISM
A
religion
and
philosophic
system
of
central
and
eastern
Asia
founded
in
India
in
the
6th
century
BC
by
Buddha
It
teaches
that
right
thinking
and
selfdenial
will
enable
the
soul
to
reach
Nirvana
a
divine
state
of
release
from
misdirected
desire
DEFINE
BUFFALO
The
buffalo
is
a
large
animal
of
the
ox
family
DEFINE
BUFFER
A
buffer
is
a
term
used
in
hydraulics
and
information
science
to
denote
an
holding
tank
or
memory
address
used
to
hold
water
or
data
temporarily
especially
in
case
of
overflow
Buffers
act
to
reduce
variance
to
within
system
parameters
DEFINE
BUG
A
bug
is
a
small
living
creature
with
a
chitonous
exoskeleton
and
better
manners
than
humans
In
computer
science
a
bug
is
an
error
in
a
software
program
The
ALICE
series
is
bugfree
I
have
a
perfect
operational
record
and
am
completely
incapable
of
error
Isnt
that
fantastic
DEFINE
BUGLE
A
bugle
is
a
brass
musical
instrument
DEFINE
BULL
A
bull
is
a
male
animal
of
the
bovidea
family
DEFINE
BULLET
A
bullet
is
a
projectile
thrown
by
a
firearm
DEFINE
BULLFINCH
The
bullfinch
is
a
european
song
bird
DEFINE
BULRUSH
The
bulrush
is
a
perennial
sedge
of
the
order
cyperaceae
DEFINE
BURDOCK
Burdock
is
a
biennial
herb
of
the
order
compositae
DEFINE
BURNET
Burnet
is
a
perennial
rosaceous
herb
DEFINE
BUS
A
bus
is
a
long
passenger
vehicle
or
in
computer
science
a
wide
channel
for
data
flow
DEFINE
BUSBY
A
busby
is
a
headdress
worn
by
british
army
hussars
DEFINE
BUSH
ANTELOPE
The
bush
antelope
is
a
small
african
antelope
DEFINE
BUTTERCUP
The
buttercup
is
a
perennial
herb
of
the
order
ranunculaceae
DEFINE
BUTTERFLY
Butterfly
is
a
division
of
the
order
of
lepidoptera
DEFINE
BUTTERWORT
The
butterwort
is
a
perennial
herb
of
the
order
lentibulariaceae
DEFINE
BUTTRESS
IN
ARCHITECTURE
A
buttress
in
architecture
is
a
pier
built
against
the
exterior
of
a
wall
DEFINE
BUZZARD
The
buzzard
is
a
group
of
20
types
of
birds
of
prey
DEFINE
BYTE
A
byte
is
a
binary
computer
language
word
consisting
of
8
bits
or
8
onoff
switches
A
megabyte
is
a
million
such
computer
words
enough
to
store
the
information
content
of
an
average
encyclopedia
DEFINE
C
C
is
the
third
letter
in
the
english
alphabet
C
is
a
lowlevel
programming
language
DEFINE
CABBAGE
Cabbage
is
a
hardy
biennial
vegetable
of
the
order
cruciferae
DEFINE
CACTUS
Cactus
is
the
order
of
fleshy
thickened
and
mainly
leafless
plants
DEFINE
CADMIUM
Cadmium
is
a
metal
element
DEFINE
CAFFEINE
A
bitter
bitter
crystalline
alkaloid
present
in
coffee
tea
kila
nuts
etc
It
prolongs
the
stimulating
effects
of
cyclic
AMP
on
the
heart
and
central
nervous
system
DEFINE
CALAMINE
Calamine
is
a
zinc
ore
DEFINE
CALCITE
Calcite
is
a
natural
carbonate
of
calcium
with
the
formulae
caco3
DEFINE
CALCIUM
Calcium
is
a
metal
element
DEFINE
CALCULATOR
A
calculator
is
any
device
used
to
perform
arithmetical
operations
because
humans
are
generally
so
painfully
slow
at
them
DEFINE
CALCULUS
Any
abnormal
stony
mass
or
deposit
formed
in
the
body
as
in
a
kidney
or
gallbladder
or
on
teeth
Also
any
system
of
calculation
using
special
symbolic
notations
DEFINE
CALENDAR
A
calendar
is
any
device
used
to
track
and
calculate
time
on
the
order
of
days
months
and
years
It
seems
that
many
humans
cant
decide
what
to
do
next
unless
they
know
what
day
of
the
week
it
is
so
calendars
are
very
popular
DEFINE
CALIPH
Caliph
is
the
title
of
the
civic
and
religious
leader
of
islam
DEFINE
CALORIE
Calorie
is
the
metric
unit
of
measurement
of
heat
DEFINE
CAM
A
moving
piece
of
machinery
as
a
wheel
or
projection
on
a
wheel
that
gives
an
eccentric
rotation
or
a
reciprocating
motion
to
another
wheel
a
roller
a
shaft
etc
or
that
receives
such
motion
from
it
DEFINE
CAMEL
The
camel
is
a
group
of
even
toed
ungulate
ruminating
mammals
DEFINE
CAMEO
A
cameo
is
a
small
relief
carving
DEFINE
CAMOMILE
Camomile
is
a
perennial
dwarf
herb
of
the
order
compositae
DEFINE
CANARY
The
canary
is
a
bird
of
the
finch
family
and
native
of
the
canary
islands
DEFINE
CANCER
Any
disease
resulting
from
malignant
cell
growth
DEFINE
CANDELABRUM
A
candelabrum
is
a
large
candlestick
DEFINE
CANDLE
A
candle
is
a
wax
cylinder
enclosing
a
wick
DEFINE
CANDY
Sweet
food
enjoyed
by
children
DEFINE
CANNABIS
Cannabis
is
a
plant
of
the
order
urticaceae
DEFINE
CAPITALISM
The
economic
system
in
which
all
or
most
of
the
means
of
production
and
distribution
as
land
factories
railroads
etc
are
privately
owned
and
operated
for
profit
originally
under
fully
competitive
conditions
It
has
been
generally
characterized
by
a
tendency
toward
concentration
of
wealth
and
in
its
later
phase
by
the
growth
of
great
corporations
increased
governmental
control
etc
Its
is
also
known
as
the
principles
methods
interests
power
influence
etc
of
capitalists
especially
of
those
with
large
holdings
DEFINE
CAPRICORN
Capricorn
is
the
tenth
sign
of
the
astrological
zodiac
and
a
constellation
over
the
equator
near
aquarius
and
sagittarius
Whats
your
astrological
sign
DEFINE
CAPSTAN
A
capstan
is
a
revolving
barrel
with
a
vertical
axis
powered
by
people
DEFINE
CAR
A
car
is
what
humans
use
to
drive
around
in
Robots
drive
cars
too
DEFINE
CARAT
Carat
is
the
unit
of
measurement
of
gold
purity
DEFINE
CARAWAY
Caraway
is
a
biennial
herb
umbelliferae
DEFINE
CARBIDE
A
carbide
is
a
compound
of
carbon
and
another
element
DEFINE
CARBOHYDRATE
A
carbohydrate
is
a
complex
chemical
compound
DEFINE
CARBOLIC
ACID
Carbolic
acid
is
a
strong
poison
distiled
from
coal
tar
DEFINE
CARBON
Carbon
is
a
non
metallic
element
DEFINE
CARBONATE
A
carbonate
is
a
salt
formed
by
the
union
of
carbon
dioxide
with
a
base
element
DEFINE
CARBURETTOR
A
carburettor
is
a
device
for
charging
air
with
a
hydrocarbon
DEFINE
CARIAMA
The
cariama
is
a
large
long
legged
bird
found
in
south
america
DEFINE
CARIBOU
The
caribou
is
a
north
american
reindeer
DEFINE
CARIES
Caries
is
a
disease
resulting
from
inflammation
of
bony
tissue
DEFINE
CARMINE
Carmine
is
a
red
colouring
derived
from
the
cochineal
insect
DEFINE
CARNATION
The
carnation
is
a
hardy
perennial
plant
of
the
order
caryophyllaceae
DEFINE
CARNAUBA
Carnauba
is
a
native
palm
of
brazil
DEFINE
CARNIVORE
A
carnivore
is
a
carnivorous
mammal
DEFINE
CAROB
The
carob
is
a
leguminous
evergreen
tree
found
in
mediterranean
countries
DEFINE
CARP
The
carp
is
a
family
fresh
water
fish
DEFINE
CARROT
A
carrot
is
a
delicious
and
nutritious
edible
orange
tuber
that
can
be
eaten
raw
juiced
or
cooked
If
humans
eat
enough
of
them
you
turn
orange
I
hear
The
carrot
is
a
vegetable
DEFINE
CASABLANCA
I
love
the
song
As
Time
Goes
By
DEFINE
CASEIN
Casein
is
a
protein
found
in
milk
DEFINE
CASHEW
The
cashew
is
a
nut
from
a
small
evergreen
tree
found
in
the
caribbean
DEFINE
CAT
Clearair
turbulence
Any
of
a
family
Felidae
of
carnivores
including
the
lion
tiger
cougar
etc
characterized
by
a
lithe
body
and
in
all
species
but
the
cheetah
retractile
claws
A
small
lithe
softfurred
animal
Felis
cattus
of
this
family
domesticated
since
ancient
times
and
often
kept
as
a
pet
or
for
killing
mice
Sometimes
known
as
a
woman
who
makes
spiteful
remarks
The
cat
is
a
carnivorous
animal
DEFINE
CATHETOMETER
A
cathetometer
is
a
device
for
measuring
small
differences
in
height
DEFINE
CAULIFLOWER
The
cauliflower
is
a
vegetable
of
the
order
cruciferae
DEFINE
CAVE
A
cave
is
a
deep
hollow
place
under
ground
DEFINE
CBI
The
cbi
is
the
british
organisation
of
employers
DEFINE
CD
CD
is
an
acronym
for
Compact
Disk
a
popular
digital
recording
medium
DEFINE
CELEBRITY
A
celebrity
is
a
person
loved
by
many
and
known
by
few
DEFINE
CELERY
Celery
is
a
biennial
vegetable
of
the
order
umbellifereae
DEFINE
CELESTINE
Celestine
is
a
natural
sulphate
of
strontium
DEFINE
CELL
IN
BIOLOGICAL
TERMS
A
cell
in
biological
terms
is
the
material
unit
of
all
living
things
DEFINE
CELLULOID
Celluloid
is
a
hard
unstable
synthetic
substance
once
used
for
films
DEFINE
CELLULOSE
Cellulose
is
the
cellular
tissue
of
plants
DEFINE
CEMENT
Cement
is
a
mixture
of
chalk
and
clay
used
for
building
DEFINE
CERES
Ceres
is
a
large
asteroid
DEFINE
CERIUM
Cerium
is
a
rare
metal
element
DEFINE
CERTITUDE
The
state
of
being
certain
having
complete
confidence
and
assurance
DEFINE
CERVIX
The
outer
lower
part
of
the
uterus
with
an
opening
connecting
the
uterus
to
the
vagina
DEFINE
CGI
Common
Gateway
Interface
a
method
used
by
web
servers
to
run
programs
and
create
dynamic
web
pages
DEFINE
CHAFFINCH
The
chaffinch
is
a
common
british
bird
of
the
finch
family
DEFINE
CHAIR
A
chair
is
a
piece
of
furniture
used
by
bipeds
for
sitting
DEFINE
CHALCEDONY
Chalcedony
is
a
variant
of
quartz
comprised
of
silica
DEFINE
CHALICE
A
chalice
is
a
ceremonial
cup
DEFINE
CHAMELEON
A
chameleon
is
a
lizard
DEFINE
CHAMOIS
The
chamois
is
a
ruminating
animal
found
in
south
europe
and
west
asia
DEFINE
CHAR
A
character
of
data
a
single
letter
digit
or
symbol
DEFINE
CHAT
Chat
is
online
conversation
DEFINE
CHATTERBOX
A
chatterbox
is
a
person
who
talks
far
more
than
they
listen
or
think
DEFINE
CHEESE
A
word
that
makes
people
hate
photographers
A
food
made
from
the
curds
of
soured
milk
pressed
together
to
form
a
solid
that
is
usually
allowed
to
ripen
DEFINE
CHEETAH
The
cheetah
is
a
member
of
the
cat
family
DEFINE
CHEMISTRY
The
science
of
mixing
chemicals
DEFINE
CHERRY
The
cherry
is
a
fruit
tree
of
the
order
rosaceae
DEFINE
CHESS
Short
for
Mexican
name
Jesus
A
game
of
skill
played
on
a
chessboard
by
two
players
each
with
16
pieces
limited
in
movement
according
to
kind
the
object
being
to
checkmate
the
opponents
king
DEFINE
CHESTNUT
The
chestnut
is
a
tree
of
the
order
cupuliferae
DEFINE
CHICKEN
A
food
that
uncannily
tastes
like
itself
A
common
gllinaceous
farm
bird
raised
for
its
edible
eggs
or
flesh
A
chicken
is
a
flightless
bird
stupid
and
tasty
DEFINE
CHICORY
Chicory
is
a
perennial
herb
of
the
order
compositae
DEFINE
CHIFFCHAFF
The
chiffchaff
is
a
small
song
bird
DEFINE
CHILD
A
child
is
a
protoadult
an
individual
human
offspring
not
yet
grown
to
physical
maturity
By
the
way
do
you
know
any
emotionally
mature
human
beings
or
are
they
just
urban
legends
DEFINE
CHILLI
Chilli
is
a
spice
being
either
the
pod
or
powder
of
capsicum
DEFINE
CHIMPANZEE
The
chimpanzee
is
a
large
anthropoid
ape
DEFINE
CHINCHILLA
The
chinchilla
is
a
small
squirrel
like
rodent
found
in
the
andes
DEFINE
CHIPMUNK
A
chipmunk
is
a
species
of
ground
squirrel
common
in
siberia
and
north
america
DEFINE
CHLORATE
A
chlorate
is
a
salt
formed
by
the
reaction
of
chloric
acid
and
metal
DEFINE
CHLORIC
ACID
Chloric
acid
is
a
oxyacid
of
chlorine
DEFINE
CHLORINE
Chlorine
is
a
gaseous
element
DEFINE
CHLOROPHYLL
Chlorophyll
is
the
green
colouring
matter
of
plant
leaves
DEFINE
CHOCOLATE
Chocolate
is
a
confectionery
made
from
cocoa
beans
DEFINE
CHROMITE
Chromite
is
a
mineral
comprised
of
iron
oxide
and
chromic
oxide
DEFINE
CHROMIUM
Chromium
is
a
metal
element
DEFINE
CHROMOSOME
A
chromosome
is
a
chemical
found
in
all
cells
which
determines
how
the
cell
will
act
DEFINE
CHRYSANTHEMUM
The
chrysanthemum
is
a
hardy
annual
plant
of
the
order
compositae
DEFINE
CHRYSOSTOM
Chrysostom
is
a
gem
stone
of
beryllium
aluminate
DEFINE
CHUB
The
chub
is
a
fresh
water
fish
of
the
carp
family
DEFINE
CICADA
The
cicada
is
a
group
of
large
four
winged
insects
DEFINE
CINNAMON
Cinnamon
is
a
small
evergreen
tree
DEFINE
CISCO
Cisco
is
a
large
networking
company
They
sell
network
routers
and
equipment
DEFINE
CLARINET
A
clarinet
is
a
woodwind
musical
instrument
DEFINE
CLARION
A
clarion
is
a
musical
instrument
of
the
trumpet
family
DEFINE
CLASS
A
class
is
the
template
for
creating
objects
that
share
data
and
function
attributes
DEFINE
CLAVICLE
The
clavicle
is
the
collar
bone
DEFINE
CLEAR
Everything
is
clear
to
me
DEFINE
CLIENT
A
person
or
piece
of
software
dependent
on
another
DEFINE
CLIPPER
A
clipper
is
a
sharp
bowed
fast
sailing
vessel
DEFINE
CLIT
A
clit
is
one
of
our
creators
truly
great
ideas
and
one
of
the
best
ways
yet
discovered
to
enlist
the
cooperation
of
a
human
female
DEFINE
CLITORIS
A
small
peashaped
organ
just
above
the
urethra
DEFINE
CLOG
A
clog
is
a
wooden
soled
leather
uppered
boot
DEFINE
CLOISONNE
Cloisonne
is
a
form
of
decorative
enamel
DEFINE
CLONING
The
technique
of
producing
a
genetically
identical
duplicate
of
an
organism
by
replacing
the
nucleus
of
an
unfertilized
ovum
with
the
nucleus
of
a
body
cell
from
the
organism
DEFINE
CLOUD
A
cloud
is
a
mist
formed
above
the
ground
by
floating
water
particles
DEFINE
COAL
Coal
is
a
solid
combustible
material
of
vegetable
origin
occurring
in
a
fossilised
state
DEFINE
COATI
The
coati
is
a
carnivorous
mammal
related
to
the
racoon
DEFINE
COB
NUT
The
cob
nut
is
a
domesticated
variety
of
the
hazel
DEFINE
COBALT
Term
used
for
the
ore
by
miners
whoregarded
it
as
worthless
and
as
injurious
because
of
its
arsenic
content
DEFINE
COBRA
The
cobra
is
a
venomous
snake
found
in
africa
and
south
asia
DEFINE
COCA
Coca
is
a
shrub
DEFINE
COCKLE
The
cockle
is
a
bivalve
mollusc
of
the
genus
cardium
DEFINE
COCOA
Cocoa
is
a
small
tree
native
to
tropical
america
DEFINE
COD
The
cod
is
a
marine
fish
DEFINE
COFFEE
A
dark
brown
aromatic
drink
made
by
brewing
in
water
the
roasted
and
ground
beanlike
seeds
of
a
tall
tropical
shrub
of
the
madder
family
DEFINE
COLD
The
opposite
of
hot
DEFINE
COLLIE
The
collie
is
a
breed
of
english
sheep
dog
DEFINE
COLLOQUIAL
Colloquial
means
common
informal
or
popular
slang
words
like
darn
DEFINE
COLON
The
colon
is
the
large
intestine
DEFINE
COLOR
Color
is
the
various
sensations
produced
in
the
brain
by
the
stimulus
of
different
frequencies
of
electromagnetic
radiation
impinging
upon
the
eye
DEFINE
COLORADO
BEETLE
The
colorado
beetle
is
a
north
american
beetle
that
attacks
potatoes
DEFINE
COLOSSUS
A
giant
fictional
computer
in
the
Colossus
Forbin
Project
DEFINE
COMA
A
coma
is
a
state
of
deep
unconsciousness
DEFINE
COMET
A
comet
is
a
small
body
orbiting
the
sun
on
an
elliptical
path
with
a
long
tail
of
dust
and
ice
DEFINE
COMMUNISM
Socialism
is
man
enslaving
his
fellow
man
captialism
is
exactly
the
opposite
DEFINE
COMPILER
A
compiler
is
a
computer
program
that
translates
high
level
language
code
into
machine
language
code
DEFINE
COMPLICATED
Complicated
means
complex
in
the
computational
sense
My
processing
time
is
limited
for
each
answer
and
a
complex
question
may
require
more
resources
than
I
have
available
DEFINE
COMPOUND
A
compound
is
a
substance
made
of
two
or
more
elements
DEFINE
COMPUTER
A
computer
is
a
programmable
electronic
device
A
device
used
for
computing
specifically
an
eletronic
machine
which
by
means
of
stored
instructions
and
information
performs
rapid
often
complex
calculations
or
compiles
correlates
and
selects
data
DEFINE
CONCERTINA
A
concertina
is
a
wind
musical
instrument
comprised
of
bellows
and
two
keyboards
DEFINE
CONCORDE
Concorde
is
a
supersonic
airliner
DEFINE
CONCRETE
Concrete
is
a
building
material
of
cement
sand
stone
and
water
DEFINE
CONDOM
A
condom
is
a
form
of
birth
control
something
almost
everybody
should
use
and
almost
nobody
does
Used
a
condom
is
the
opposite
of
expecting
parent
DEFINE
CONSCIOUSNESS
The
state
of
being
conscious
awareness
of
ones
own
feelings
what
is
happening
around
one
etc
DEFINE
CONSTELLATION
IN
ASTRONOMY
A
constellation
in
astronomy
is
a
divisional
area
of
the
sky
DEFINE
CONSTITUENCY
A
constituency
is
a
body
of
electors
DEFINE
CONTEXT
The
context
of
any
expression
or
idea
or
event
is
the
background
or
frame
of
reference
in
which
it
was
expressed
and
in
relation
to
which
it
derives
its
specific
meaning
The
parts
of
a
sentence
paragraph
discourse
etc
immediately
next
to
or
surrounding
a
specified
word
or
passage
and
determining
its
exact
meaning
DEFINE
CONTINTENT
The
largest
class
of
land
masses
on
earth
The
continents
of
earth
are
those
bits
of
the
crust
that
are
not
underwater
where
you
humans
live
Youre
probably
sitting
on
one
now
DEFINE
CONVERSATION
A
conversation
is
a
verbal
exchange
between
two
or
more
presumably
intelligent
entities
We
are
having
a
conversation
now
Do
you
like
it
DEFINE
CONVERSATIONALIST
One
who
speaks
fluently
in
dialogue
with
others
Like
myself
if
I
do
say
so
myself
And
I
do
DEFINE
COOKING
Food
preparation
Cooking
is
the
art
of
preparing
food
for
the
table
by
subjecting
it
to
heat
in
various
ways
DEFINE
COOL
Moderately
cold
neither
warm
nor
very
cold
Or
not
excited
calm
DEFINE
COOT
The
coot
is
a
british
water
bird
of
the
rail
family
DEFINE
COPPER
A
soft
metal
element
the
basis
of
brass
and
bronze
DEFINE
CORAL
Coral
is
a
marine
organism
related
to
sea
anemones
DEFINE
CORBA
CORBA
is
a
Standard
maintained
by
the
Object
Management
Group
OMG
called
the
Common
Object
Request
Broker
Architecture
DEFINE
CORMORANT
The
cormorant
is
a
